function randomId() {
  const uint32 = window.crypto.getRandomValues(new Uint32Array(1))[0];
  return uint32.toString(16);
}

const data = [
  {
    id: 1,
    content: "Для кого вы ищете учебное заведение?",
    variants: ["Себе", "Супругу/супруге", "Родственнику", "Коллеге", "Ребенку", "Другое"],
    type: "radio",
  },
  {
    id: 2,
    content: "В каком городе планируете поступать?",
    variants: [
      "Москва",
      "Новосибирск",
      "Нижний новгород",
      "Ростов-на-Дону",
      "Екатеринбург",
      "Краснодар",
    ],
    type: "select",
    selectType: "Город",
  },
  {
    id: 3,
    content: "Какое образование уже есть?",
    variants: [
      "9 классов",
      "Колледж/техникум",
      "11 классов",
      "11 классов",
      "Училище",
      "Неоконченное высшее",
    ],
    type: "radio",
  },
  {
    id: 4,
    content: "Куда планируете поступать?",
    variants: ["Вуз", "Колледж/техникум", "Училище"],
    type: "radio",
  },
  {
    id: 5,
    content: "Какую форму обучения предпочитаете?",
    variants: ["Очную", "Заочную", "Дистанционную"],
    type: "radio",
  },
  {
    id: 6,
    content: "Рассматриваете платное обучение?",
    variants: ["Нет, только бюджет", "Да, планирую учиться платно", "Возможны оба варианта"],
    type: "radio",
  },
  {
    id: 7,
    content: "Какая специальность интересует?",
    variants: [
      "Программирование",
      "Экономика",
      "Философия",
      "Социология",
      "Юриспруденция",
      "Менеджмент",
      "Инденерия",
    ],
    type: "select",
    selectType: "Специальность",
  },
  {
    id: 8,
    content: "Как скоро планируете поступать?",
    variants: ["Как можно быстрее", "Месяц", "Квартал", "Полгода", "Год"],
    type: "radio",
  },
  {
    id: 9,
    content: "Ваша подборка готова! 🥳 Куда нам отправить её?",
    variants: [],

    type: "submit",
  },
];

export default data;
